# parameters
nc: 28  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
# more info anchors: modify the anchors??? #3116 https://github.com/ultralytics/yolov5/issues/3116
# moreinfo P3/8    : Can't understand the "P3/8".  #2835    https://github.com/ultralytics/yolov5/issues/2835

# autoanchor takes care of this, we need only to change the coordinate e.g. xyz for 3d
# Ps are different scales of the image using strides e.g. 8
# anchors
anchors:
  - [10,13,10, 16,30,30, 33,23,30]       # P3/8  e.g. 128/8  = 16
  - [30,61,60, 62,45,45, 59,119,119]     # P4/16 e.g. 128/16 = 8
  - [64,64,64, 100,100,100, 128,128,128] # P5/32 e.g. 128/32 = 4

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus3D, [64, 3]],      # 0-P1/2
   [-1, 1, Conv3D, [128, 3, 2]] ,  # 1-P2/4
   [-1, 3, C33D, [128]],
   [-1, 1, Conv3D, [256, 3, 2]],   # 3-P3/8
   [-1, 9, C33D, [256]],
   [-1, 1, Conv3D, [512, 3, 2]],   # 5-P4/16
   [-1, 9, C33D, [512]],
   [-1, 1, Conv3D, [1024, 3, 2]],  # 7-P5/32
   [-1, 1, SPP3D, [1024, [5, 9, 13]]],
   [-1, 3, C33D, [1024, False]],  # 9
  ]

# YOLOv5 head
head:
  [
   [-1, 1, Conv3D, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C33D, [512, False]],  # 13

   [-1, 1, Conv3D, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C33D, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv3D, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C33D, [512, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv3D, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C33D, [1024, False]],  # 23 (P5/32-large)

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
